pbaizan/Arduino_package_VISIR_Ionosens_Boards/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

VISB2560.name=VISIR Instrument Supply Board 2560 (VISB2560)

VISB2560.upload.tool=avrdude
VISB2560.upload.protocol=wiring
VISB2560.upload.maximum_size=253952
VISB2560.upload.maximum_data_size=8192
VISB2560.upload.speed=115200

VISB2560.bootloader.tool=avrdude
VISB2560.bootloader.low_fuses=0xFF
VISB2560.bootloader.high_fuses=0xD8
VISB2560.bootloader.extended_fuses=0xFD
VISB2560.bootloader.file=stk500v2/stk500boot_v2_VISB2560.hex
VISB2560.bootloader.unlock_bits=0x3F
VISB2560.bootloader.lock_bits=0x0F

VISB2560.build.mcu=atmega2560
VISB2560.build.f_cpu=16000000L
VISB2560.build.board=VISB2560
VISB2560.build.core=arduino
VISB2560.build.variant=VISB2560

##############################################################

VISB32U4.name=VISIR Instrument Supply Board 32U4 (VISB32U4)

VISB32U4.vid.0=0x2341
VISB32U4.pid.0=0x0037
VISB32U4.vid.1=0x2341
VISB32U4.pid.1=0x8037
VISB32U4.vid.2=0x2A03
VISB32U4.pid.2=0x0037
VISB32U4.vid.3=0x2A03
VISB32U4.pid.3=0x8037
VISB32U4.vid.4=0x2341
VISB32U4.pid.4=0x0237
VISB32U4.vid.5=0x2341
VISB32U4.pid.5=0x8237

VISB32U4.upload.tool=avrdude
VISB32U4.upload.protocol=avr109
VISB32U4.upload.maximum_size=28672
VISB32U4.upload.maximum_data_size=2560
VISB32U4.upload.speed=57600
VISB32U4.upload.disable_flushing=true
VISB32U4.upload.use_1200bps_touch=true
VISB32U4.upload.wait_for_upload_port=true

VISB32U4.bootloader.tool=avrdude
VISB32U4.bootloader.low_fuses=0xff
VISB32U4.bootloader.high_fuses=0xd8
VISB32U4.bootloader.extended_fuses=0xcb
VISB32U4.bootloader.file=caterina/Caterina-Micro.hex
VISB32U4.bootloader.unlock_bits=0x3F
VISB32U4.bootloader.lock_bits=0x2F

VISB32U4.build.mcu=atmega32u4
VISB32U4.build.f_cpu=16000000L
VISB32U4.build.vid=0x2341
VISB32U4.build.pid=0x8037
VISB32U4.build.usb_product="VISB32U4"
VISB32U4.build.board=VISB32U4
VISB32U4.build.core=VISB32U4
VISB32U4.build.variant=VISB32U4
VISB32U4.build.extra_flags={build.usb_flags}